{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "conv2d_526", "class_name": "Conv2D", "config": {"name": "conv2d_526", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "batch_normalization_513", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_513", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_526", 0, 0, {}]]]}, {"name": "activation_517", "class_name": "Activation", "config": {"name": "activation_517", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_513", 0, 0, {}]]]}, {"name": "conv2d_527", "class_name": "Conv2D", "config": {"name": "conv2d_527", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_517", 0, 0, {}]]]}, {"name": "dropout_507", "class_name": "Dropout", "config": {"name": "dropout_507", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_527", 0, 0, {}]]]}, {"name": "merge_517", "class_name": "Merge", "config": {"name": "merge_517", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv2d_526", 0, 0, {"mask": [null, null]}], ["dropout_507", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_514", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_514", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_517", 0, 0, {}]]]}, {"name": "activation_518", "class_name": "Activation", "config": {"name": "activation_518", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_514", 0, 0, {}]]]}, {"name": "conv2d_528", "class_name": "Conv2D", "config": {"name": "conv2d_528", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_518", 0, 0, {}]]]}, {"name": "dropout_508", "class_name": "Dropout", "config": {"name": "dropout_508", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_528", 0, 0, {}]]]}, {"name": "merge_518", "class_name": "Merge", "config": {"name": "merge_518", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_517", 0, 0, {"mask": [null, null]}], ["dropout_508", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_515", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_515", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_518", 0, 0, {}]]]}, {"name": "activation_519", "class_name": "Activation", "config": {"name": "activation_519", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_515", 0, 0, {}]]]}, {"name": "conv2d_529", "class_name": "Conv2D", "config": {"name": "conv2d_529", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_519", 0, 0, {}]]]}, {"name": "dropout_509", "class_name": "Dropout", "config": {"name": "dropout_509", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_529", 0, 0, {}]]]}, {"name": "merge_519", "class_name": "Merge", "config": {"name": "merge_519", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_518", 0, 0, {"mask": [null, null]}], ["dropout_509", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_516", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_516", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_519", 0, 0, {}]]]}, {"name": "activation_520", "class_name": "Activation", "config": {"name": "activation_520", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_516", 0, 0, {}]]]}, {"name": "conv2d_530", "class_name": "Conv2D", "config": {"name": "conv2d_530", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_520", 0, 0, {}]]]}, {"name": "dropout_510", "class_name": "Dropout", "config": {"name": "dropout_510", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_530", 0, 0, {}]]]}, {"name": "merge_520", "class_name": "Merge", "config": {"name": "merge_520", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_519", 0, 0, {"mask": [null, null]}], ["dropout_510", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_517", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_517", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_520", 0, 0, {}]]]}, {"name": "activation_521", "class_name": "Activation", "config": {"name": "activation_521", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_517", 0, 0, {}]]]}, {"name": "conv2d_531", "class_name": "Conv2D", "config": {"name": "conv2d_531", "trainable": true, "filters": 112, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_521", 0, 0, {}]]]}, {"name": "dropout_511", "class_name": "Dropout", "config": {"name": "dropout_511", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_531", 0, 0, {}]]]}, {"name": "batch_normalization_518", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_518", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_511", 0, 0, {}]]]}, {"name": "activation_522", "class_name": "Activation", "config": {"name": "activation_522", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_518", 0, 0, {}]]]}, {"name": "conv2d_532", "class_name": "Conv2D", "config": {"name": "conv2d_532", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_522", 0, 0, {}]]]}, {"name": "dropout_512", "class_name": "Dropout", "config": {"name": "dropout_512", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_532", 0, 0, {}]]]}, {"name": "merge_521", "class_name": "Merge", "config": {"name": "merge_521", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_511", 0, 0, {"mask": [null, null]}], ["dropout_512", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_519", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_519", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_521", 0, 0, {}]]]}, {"name": "activation_523", "class_name": "Activation", "config": {"name": "activation_523", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_519", 0, 0, {}]]]}, {"name": "conv2d_533", "class_name": "Conv2D", "config": {"name": "conv2d_533", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_523", 0, 0, {}]]]}, {"name": "dropout_513", "class_name": "Dropout", "config": {"name": "dropout_513", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_533", 0, 0, {}]]]}, {"name": "merge_522", "class_name": "Merge", "config": {"name": "merge_522", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_521", 0, 0, {"mask": [null, null]}], ["dropout_513", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_520", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_520", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_522", 0, 0, {}]]]}, {"name": "activation_524", "class_name": "Activation", "config": {"name": "activation_524", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_520", 0, 0, {}]]]}, {"name": "conv2d_534", "class_name": "Conv2D", "config": {"name": "conv2d_534", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_524", 0, 0, {}]]]}, {"name": "dropout_514", "class_name": "Dropout", "config": {"name": "dropout_514", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_534", 0, 0, {}]]]}, {"name": "merge_523", "class_name": "Merge", "config": {"name": "merge_523", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_522", 0, 0, {"mask": [null, null]}], ["dropout_514", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_521", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_521", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_523", 0, 0, {}]]]}, {"name": "activation_525", "class_name": "Activation", "config": {"name": "activation_525", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_521", 0, 0, {}]]]}, {"name": "conv2d_535", "class_name": "Conv2D", "config": {"name": "conv2d_535", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_525", 0, 0, {}]]]}, {"name": "dropout_515", "class_name": "Dropout", "config": {"name": "dropout_515", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_535", 0, 0, {}]]]}, {"name": "merge_524", "class_name": "Merge", "config": {"name": "merge_524", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_523", 0, 0, {"mask": [null, null]}], ["dropout_515", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_522", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_522", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_524", 0, 0, {}]]]}, {"name": "activation_526", "class_name": "Activation", "config": {"name": "activation_526", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_522", 0, 0, {}]]]}, {"name": "conv2d_536", "class_name": "Conv2D", "config": {"name": "conv2d_536", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_526", 0, 0, {}]]]}, {"name": "dropout_516", "class_name": "Dropout", "config": {"name": "dropout_516", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_536", 0, 0, {}]]]}, {"name": "merge_525", "class_name": "Merge", "config": {"name": "merge_525", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_524", 0, 0, {"mask": [null, null]}], ["dropout_516", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_523", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_523", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_525", 0, 0, {}]]]}, {"name": "activation_527", "class_name": "Activation", "config": {"name": "activation_527", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_523", 0, 0, {}]]]}, {"name": "conv2d_537", "class_name": "Conv2D", "config": {"name": "conv2d_537", "trainable": true, "filters": 192, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_527", 0, 0, {}]]]}, {"name": "dropout_517", "class_name": "Dropout", "config": {"name": "dropout_517", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_537", 0, 0, {}]]]}, {"name": "batch_normalization_524", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_524", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_517", 0, 0, {}]]]}, {"name": "activation_528", "class_name": "Activation", "config": {"name": "activation_528", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_524", 0, 0, {}]]]}, {"name": "conv2d_538", "class_name": "Conv2D", "config": {"name": "conv2d_538", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_528", 0, 0, {}]]]}, {"name": "dropout_518", "class_name": "Dropout", "config": {"name": "dropout_518", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_538", 0, 0, {}]]]}, {"name": "merge_526", "class_name": "Merge", "config": {"name": "merge_526", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_517", 0, 0, {"mask": [null, null]}], ["dropout_518", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_525", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_525", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_526", 0, 0, {}]]]}, {"name": "activation_529", "class_name": "Activation", "config": {"name": "activation_529", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_525", 0, 0, {}]]]}, {"name": "conv2d_539", "class_name": "Conv2D", "config": {"name": "conv2d_539", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_529", 0, 0, {}]]]}, {"name": "dropout_519", "class_name": "Dropout", "config": {"name": "dropout_519", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_539", 0, 0, {}]]]}, {"name": "merge_527", "class_name": "Merge", "config": {"name": "merge_527", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_526", 0, 0, {"mask": [null, null]}], ["dropout_519", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_526", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_526", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_527", 0, 0, {}]]]}, {"name": "activation_530", "class_name": "Activation", "config": {"name": "activation_530", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_526", 0, 0, {}]]]}, {"name": "conv2d_540", "class_name": "Conv2D", "config": {"name": "conv2d_540", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_530", 0, 0, {}]]]}, {"name": "dropout_520", "class_name": "Dropout", "config": {"name": "dropout_520", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_540", 0, 0, {}]]]}, {"name": "merge_528", "class_name": "Merge", "config": {"name": "merge_528", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_527", 0, 0, {"mask": [null, null]}], ["dropout_520", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_527", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_527", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_528", 0, 0, {}]]]}, {"name": "activation_531", "class_name": "Activation", "config": {"name": "activation_531", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_527", 0, 0, {}]]]}, {"name": "conv2d_541", "class_name": "Conv2D", "config": {"name": "conv2d_541", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_531", 0, 0, {}]]]}, {"name": "dropout_521", "class_name": "Dropout", "config": {"name": "dropout_521", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_541", 0, 0, {}]]]}, {"name": "merge_529", "class_name": "Merge", "config": {"name": "merge_529", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_528", 0, 0, {"mask": [null, null]}], ["dropout_521", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_528", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_528", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_529", 0, 0, {}]]]}, {"name": "activation_532", "class_name": "Activation", "config": {"name": "activation_532", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_528", 0, 0, {}]]]}, {"name": "conv2d_542", "class_name": "Conv2D", "config": {"name": "conv2d_542", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_532", 0, 0, {}]]]}, {"name": "dropout_522", "class_name": "Dropout", "config": {"name": "dropout_522", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_542", 0, 0, {}]]]}, {"name": "merge_530", "class_name": "Merge", "config": {"name": "merge_530", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_529", 0, 0, {"mask": [null, null]}], ["dropout_522", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_529", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_529", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_530", 0, 0, {}]]]}, {"name": "activation_533", "class_name": "Activation", "config": {"name": "activation_533", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_529", 0, 0, {}]]]}, {"name": "conv2d_543", "class_name": "Conv2D", "config": {"name": "conv2d_543", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_533", 0, 0, {}]]]}, {"name": "dropout_523", "class_name": "Dropout", "config": {"name": "dropout_523", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_543", 0, 0, {}]]]}, {"name": "merge_531", "class_name": "Merge", "config": {"name": "merge_531", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_530", 0, 0, {"mask": [null, null]}], ["dropout_523", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_530", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_530", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_531", 0, 0, {}]]]}, {"name": "activation_534", "class_name": "Activation", "config": {"name": "activation_534", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_530", 0, 0, {}]]]}, {"name": "conv2d_544", "class_name": "Conv2D", "config": {"name": "conv2d_544", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_534", 0, 0, {}]]]}, {"name": "dropout_524", "class_name": "Dropout", "config": {"name": "dropout_524", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_544", 0, 0, {}]]]}, {"name": "merge_532", "class_name": "Merge", "config": {"name": "merge_532", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_531", 0, 0, {"mask": [null, null]}], ["dropout_524", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_531", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_531", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_532", 0, 0, {}]]]}, {"name": "activation_535", "class_name": "Activation", "config": {"name": "activation_535", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_531", 0, 0, {}]]]}, {"name": "conv2d_545", "class_name": "Conv2D", "config": {"name": "conv2d_545", "trainable": true, "filters": 304, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_535", 0, 0, {}]]]}, {"name": "dropout_525", "class_name": "Dropout", "config": {"name": "dropout_525", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_545", 0, 0, {}]]]}, {"name": "batch_normalization_532", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_532", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_525", 0, 0, {}]]]}, {"name": "activation_536", "class_name": "Activation", "config": {"name": "activation_536", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_532", 0, 0, {}]]]}, {"name": "conv2d_546", "class_name": "Conv2D", "config": {"name": "conv2d_546", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_536", 0, 0, {}]]]}, {"name": "dropout_526", "class_name": "Dropout", "config": {"name": "dropout_526", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_546", 0, 0, {}]]]}, {"name": "merge_533", "class_name": "Merge", "config": {"name": "merge_533", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_525", 0, 0, {"mask": [null, null]}], ["dropout_526", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_533", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_533", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_533", 0, 0, {}]]]}, {"name": "activation_537", "class_name": "Activation", "config": {"name": "activation_537", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_533", 0, 0, {}]]]}, {"name": "conv2d_547", "class_name": "Conv2D", "config": {"name": "conv2d_547", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_537", 0, 0, {}]]]}, {"name": "dropout_527", "class_name": "Dropout", "config": {"name": "dropout_527", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_547", 0, 0, {}]]]}, {"name": "merge_534", "class_name": "Merge", "config": {"name": "merge_534", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_533", 0, 0, {"mask": [null, null]}], ["dropout_527", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_534", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_534", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_534", 0, 0, {}]]]}, {"name": "activation_538", "class_name": "Activation", "config": {"name": "activation_538", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_534", 0, 0, {}]]]}, {"name": "conv2d_548", "class_name": "Conv2D", "config": {"name": "conv2d_548", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_538", 0, 0, {}]]]}, {"name": "dropout_528", "class_name": "Dropout", "config": {"name": "dropout_528", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_548", 0, 0, {}]]]}, {"name": "merge_535", "class_name": "Merge", "config": {"name": "merge_535", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_534", 0, 0, {"mask": [null, null]}], ["dropout_528", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_535", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_535", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["merge_535", 0, 0, {}]]]}, {"name": "activation_539", "class_name": "Activation", "config": {"name": "activation_539", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_535", 0, 0, {}]]]}, {"name": "conv2d_549", "class_name": "Conv2D", "config": {"name": "conv2d_549", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_539", 0, 0, {}]]]}, {"name": "dropout_529", "class_name": "Dropout", "config": {"name": "dropout_529", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_549", 0, 0, {}]]]}, {"name": "merge_536", "class_name": "Merge", "config": {"name": "merge_536", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["merge_535", 0, 0, {"mask": [null, null]}], ["dropout_529", 0, 0, {"mask": [null, null]}]]]}, {"name": "batch_normalization_536", 